class Data:
    def __init__(self, forms):
        self.city = {'Тбилиси':
                         ['Тбилиси', 1996871],
                     'Батуми':
                         ['Батуми', 8742159],
                     'Кутаиси':
                         ['Кутаиси', 8742174],
                     'Рустави':
                         ['Рустави', 5997314]}
        self.regions = {'Тбилиси':
                            {'Глдани': 687578743,
                             'Дидубе': 687611312,
                             'Ваке': 687611312,
                             'Исани': 688350922,
                             'Крцанисский': 689701920,
                             'Мтанцминда': 689678147,
                             'Надзаладеви': 688137211,
                             'Сабуртало': 687602533,
                             'Самгори': 688330506,
                             'Чугурети': 687618311,
                             'Окрестности Тбилиси': -1},
                        'Батуми':
                            {"Аэропорт": 776481390,
                             "Агмашенебели": 776472116,
                             "Багратиони": 776471185,
                             "Бони-Городокский район": 777654897,
                             "Поселок Тамар": 776734274,
                             "Кахаберийский район": 776998491,
                             "Руставельский район": 776460995,
                             "Старый Батуми": 776458944,
                             "Химшиашвили": 776463102,
                             "Джавахишвили Район": 776465448},
                        'Кутаиси':
                            {"Поселок Авангарди": 204509374,
                             "Поселок Автокархана": 204528515,
                             "Поселок Асатиани": 206352209,
                             "Пос. Агмашенебели": 206348743,
                             "Балахвани": 2145069828,
                             "Бжолеби": 206349513,
                             "Холм Габашвили": 206345188,
                             "Гора Сакуслиа": 206349304,
                             "Гуматеси": 2163598831,
                             "Вакисубани": 204509275,
                             "Застава": 5279555,
                             "Мепесутубани": 204507826,
                             "Мцванеквавила": 206347371,
                             "Поселок Никея": 204509276,
                             "Ниноцминда": 206352104,
                             "Рионгеси": 6002742,
                             "Сафичхиа": 2163556035,
                             "Сагориа": 204508541,
                             "Укимериони": 206345498,
                             "Кроника": 206349898,
                             "Поселок Чавчавадзе": 206348604,
                             "Чома": 206393819},
                        'Кобулети': ''}
        self.type_s = {'Продажа': 1, 'Аренда': 3, 'Аренда посуточно': 7}
        self.type_s_towr = {'Квартира': 1, 'Дом': 2, 'Коммерческая площадь': 3}
        self.forms = forms

    def formats(self):
        lastForm = {'Keyword': self.city[self.forms['town']][0],
                    'cities': self.city[self.forms['town']][1],
                    'GID': self.city[self.forms['town']][1],
                    'regions': self.regions[self.forms['town']][self.forms['district']],
                    'fullregions': self.regions[self.forms['town']][self.forms['district']],
                    'AdTypeID': 3,
                    'PrTypeID%5B%5D': self.type_s_towr[self.forms['type_of_house']],
                    'SortID': 1,
                    'FCurrencyID': 1,
                    'RoomNums%5B%5D': int(self.forms['flat_quolity']),
                    'FPriceFrom': int(self.forms['min_prise']),
                    'FPriceTo': int(self.forms['max_prise'])}
        if self.forms['handle_owner'] == 'Да':
            lastForm['OwnerTypeID'] = 1
        if self.forms['town'] != 'тбилиси':
            lastForm['districts'] = lastForm.pop('regions')
            del lastForm['fullregions']

            # if add bot check $ or lari
            # if fo сrms['Макс - мин цена, валюта'][2] == 'Доллар':
            #     lastForm['FCurrencyID'] = 1
            # elif forms['Макс - мин цена, валюта'][2] == 'Лари':
            #     lastForm['FCurrencyID'] = 3

        return lastForm
