class data:
    def __init__(self):
        self.city = {'Тбилиси':
                         ['Тбилиси', 1996871],
                     'Батуми':
                         ['Батуми', 874215],
                     'Кутаиси':
                         ['Кутаиси', 8742174],
                     'Рустави':
                         ['Рустави', 5997314]
                     }
        self.regions = {'Тбилиси':
                            {'Глдани': 687578743,
                             'Дидубе': 687611312,
                             'Ваке': 687611312,
                             'Исани': 688350922,
                             'Крцанисский': 689701920,
                             'Мтанцминда': 689678147,
                             'Надзаладеви': 688137211,
                             'Сабуртало': 687602533,
                             'Самгори': 688330506,
                             'Чугурети': 687618311
                             }
                        }
        self.type_s = {'Продажа': 1, 'Аренда': 3, 'Аренда посуточно': 7}
        self.type_s_towr = {'Квартира': 1, 'Дома и дачи': 2, 'Коммерческая площадь': 3}

    def formats(self, forms):
        lastForm = {
            'Keyword': self.city[forms['Город']][0],
            'cities': self.city[forms['Город']][1],
            'regions': self.regions[forms['Город']][forms['Регион']],
            'fullregions': self.regions[forms['Город']][forms['Регион']],
            'AdType': self.type_s[forms['Тип поиска']],
            'PrTypeID%5B%5D': self.type_s_towr[forms['Тип жилья']],
            'SortID': 1,
        }
        if forms['Собственник'] == 'Да':
            lastForm['OwnerTypeID'] = 1
        if forms['Сортировка по цене'] == 'Да':
            lastForm['FPriceFrom'] = forms['Макс - мин цена, валюта'][1]
            lastForm['FPriceTo'] = forms['Макс - мин цена, валюта'][0]
            if forms['Макс - мин цена, валюта'][2] == 'Доллар':
                lastForm['FCurrencyID'] = 1
            elif forms['Макс - мин цена, валюта'][2] == 'Лари':
                lastForm['FCurrencyID'] = 3

        return lastForm


x = data()
print(x.formats({'Город': 'Тбилиси', 'Регион': 'Глдани', 'Тип поиска': 'Аренда', 'Тип жилья': 'Квартира',
           'Сортировка по цене': 'Да',
           'Макс - мин цена, валюта': [500, 300, 'Доллар'], 'Собственник': 'Да'}))
# Если лари то FCurrencyID 3, если доллар 1
